{
    "courses": {

        "09110601": {
            "title_en": "Research Methodology in Computational Optimization and Machine Learning",
            "title_th": "ระเบียบวิธีวิจัยการหาค่าเหมาะที่สุดเชิงคำนวณและการเรียนรู้ของเครื่อง",
            "type": 0,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Research process, research types, research problem determination, literature review; conjecture or assumption construction, proposal and research report writing, reference writing, ethics of researchers, research techniques in computational optimization and machine learning, English for research writing.",
            "description_th": "กระบวนการทำวิจัย ประเภทการวิจัย การกำหนดปัญหาการวิจัย การทบทวนวรรณกรรม การสร้างข้อคาดการณ์หรือสมมติฐานการวิจัย การเขียนโครงร่างและรายงานการวิจัย การอ้างอิงผลงาน การนำเสนอผลงานวิจัยจรรยาบรรณของนักวิจัย เทคนิควิธีการวิจัยเฉพาะทางการหาค่าเหมาะที่สุดเชิงคำนวณและการเรียนรู้ของเครื่อง ภาษาอังกฤษเพื่อการเขียนงานวิจัย ",
            "clos": [
                "ออกแบบและวางแผนการทำวิจัยได้อย่างถูกต้องตามกระบวนการการทำวิจัยทางวิทยาศาสตร์",
                 "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [3, 8, 10],
            "plos_mapping": [3, 8, 10]
        },

        "09110602": {
            "title_en": "Seminar",
            "title_th": "สัมมนา",
            "type": 0,
            "group": 1,
            "credits": 1,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Seminar on articles selected from scientific journals focusing on topics concerning computational optimization and machine learning, the students are obliged to analyze, summaries, give an oral presentation, discuss, and answer the questions, required written report and presentation the selected topics.",
            "description_th": "ศึกษาค้นคว้าบทความที่อยู่ในฐานข้อมูลทางวิทยาศาสตร์ นำเสนอผลการวิจัย วิเคราะห์ อภิปราย สรุปผล ตั้ง คำถามและตอบคำถามจากผู้ร่วมสัมมนาได้ นักศึกษาต้องเขียนรายงานและนำเสนอต่อคณะกรรมการของสาขาวิชา",
            "clos": [
                "อธิบายบทความวิจัยที่เกี่ยวข้องกับการคำนวณเชิงคณิตศาสตร์และการเรียนรู้ของเครื่องในปัจจุบันได้",
                "วิเคราะห์ อภิปราย สรุปผล และตอบคำถามจากผู้เข้าร่วมสัมมนาได้ ",
                "นำเสนอหัวข้อที่เลือกในรูปแบบภาษาไทยและภาษาอังกฤษได้"
            ],
            "los_mapping": [8, 10],
            "plos_mapping": [8, 10]
        },

        "09111601": {
            "title_en": "Statistics and Probability for Machine Learning",
            "title_th": "สถิติและความน่าจะเป็นสำหรับการเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Basic theories in statistics for machine learning, probability, discrete random variables, continuous random variables, joint distributions, expectation, conditional expectation, statistical limit theorems, estimation of parameters, maximum likelihood estimation, Bayesian approach to parameter estimation, hypothesis testing, confidence intervals, random processes.",
            "description_th": "ทฤษฎีพื้นฐานในสถิติสำหรับการเรียนรู้ของเครื่อง ความน่าจะเป็น ตัวแปรสุ่มแบบไม่ต่อเนื่อง ตัวแปรสุ่มแบบต่อเนื่อง การแจกแจงร่วม ค่าคาดหวัง ค่าคาดหวังแบบมีเงื่อนไข ทฤษฎีลิมิตทางสถิติ การประมาณค่าพารามิเตอร์ การประมาณภาวะน่าจะเป็นสูงสุด วิธีการแบบเบย์ในการประมาณค่าพารามิเตอร์ การทดสอบสมมติฐาน ช่วงความเชื่อมั่น กระบวนการเฟ้นสุ่ม",
            "clos": [
                "อธิบายการหาความน่าจะเป็นของเหตุการณ์ในรูปแบบต่างๆได้",
                 "อธิบายการหาค่าคาดหวังแบบมีเงื่อนไขของตัวแปรสุ่มแบบไม่ต่อเนื่องและแบบต่อเนื่อง",
                  "อธิบายการเลือกใช้วิธีทางสถิติในการประมาณค่าพารามิเตอร์ต่างๆกับชุดข้อมูลที่มีความหลากหลายได้อย่างเหมาะสม",
                  "ใช้เครื่องมือมาช่วยในการวิเคราะห์ข้อมูลและนำเสนอข้อมูลได้"

            ],
            "los_mapping": [2, 10],
            "plos_mapping": [2, 10]
        },


        "09111602": {
            "title_en": "Mathematics for Machine Learning",
            "title_th": "คณิตศาสตร์สำหรับการเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Matrices and matrix algebra, system of linear equation and solving systems of linear equations, vector space, linear Independence, basis, orthonormal basis, linear transformation, eigen value and eigen vector, diagonalization of matrices, norm, inner product, lengths and distances, orthogonal complement, matrix decompositions, Cholesky decomposition, matrix approximation.",
            "description_th": "เมทริกซ์และการดำเนินการบนเมทริกซ์ ระบบสมการเชิงเส้นและการหาผลเฉลย ปริภูมิเวกเตอร์ ความเป็นอิสระเชิงเส้น ฐานหลัก ฐานหลักเชิงตั้งฉาก การแปลงเชิงเส้น ค่าเจาะจงและเวกเตอร์เจาะจง การทำให้เป็นเมทริกซ์ทแยงมุม นอร์ม ผลคูณภายใน ความยาวและระยะทาง ส่วนประกอบเชิงตั้งฉาก การแยกเมทริกซ์ การแยกโชเลสกี การประมาณค่าเมทริกซ์",
            "clos": [
                "อธิบายการหาพีชคณิตของเมทริกซ์และหาผลเฉลยของระบบสมการเชิงเส้นได้",
                "อธิบายความเป็นอิสระเชิงเส้น ฐานหลัก และอธิบายการหามิติของเวกเตอร์ได้",
                "อธิบายการหาค่าเจาะจงและเวกเตอร์เจาะจงได้",
                "อธิบายการหาความยาว ระยะทางและส่วนประกอบเชิงตั้งฉากของเวกเตอร์ได้",
                "อธิบายการเขียนเมทริกซ์ให้อยู่ในรูปของการแยกเมทริกซ์ได้",
                 "ใช้เครื่องมือมาช่วยในการคำนวณเพื่อแก้ปัญหาทางคณิตศาสตร์ได้"
            ],
            "los_mapping": [1, 2, 10],
            "plos_mapping": [1, 2, 10]
        },

        "09111603": {
            "title_en": "Machine Learning",
            "title_th": "การเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Concepts, theories and principle of machine learning, algorithms for machine learning, supervised learning, unsupervised learning, deep learning, learning theory, reinforcement learning, model evaluation techniques in machine learning.",
            "description_th": "แนวคิด ทฤษฎีและหลักการเกี่ยวกับการเรียนรู้ของเครื่อง อัลกอริทึมสำหรับการเรียนรู้ของเครื่องการเรียนรู้แบบมีผู้สอน การเรียนรู้แบบไม่มีผู้สอน การเรียนรู้เชิงลึก ทฤษฎีการเรียนรู้ การเรียนรู้แบบเสริมกำลัง เทคนิค การประเมินแบบจำลองการเรียนรู้ของเครื่อง",
            "clos": [
                "อธิบายแนวคิด ทฤษฎีและหลักการเกี่ยวกับการเรียนรู้ของเครื่องได้",
                "อธิบายการเลือกใช้อัลกอริทึมที่เหมาะสมในการแก้ปัญหาได้",
                "สร้างหรือพัฒนาแบบอัลกอริทึมสำหรับการเรียนรู้ของเครื่องการเรียนรู้เพื่อใช้แก้ปัญหาได้",
                "อธิบายการหาความยาว ระยะทางและส่วนประกอบเชิงตั้งฉากของเวกเตอร์ได้",
                "วิเคราะห์ประสิทธิภาพของแบบจำลองการเรียนรู้ของเครื่องได้"
            ],
            "los_mapping": [1, 2, 10],
            "plos_mapping": [1, 2, 10]

        },

        "09111704": {
            "title_en": "Optimization for Machine Learning",
            "title_th": "การหาค่าเหมาะที่สุดสำหรับการเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Basic theories of optimization, constrained optimization, unconstrained optimization, smooth and nonsmooth optimization, first-order optimization algorithms, second-order optimization algorithms, stochastic gradient descent algorithm, proximal gradient method, algorithm implementation in Python.",
            "description_th": "ทฤษฎีพื้นฐานของปัญหาการหาค่าเหมาะที่สุด ปัญหาการหาค่าเหมาะที่สุดแบบมีข้อจำกัด ปัญหาการหาค่าเหมาะที่สุดแบบไม่มีข้อจำกัด ปัญหาการหาค่าเหมาะที่สุดแบบปรับเรียบ และไม่ปรับเรียบ อัลกอริทึมค่าเหมาะที่สุดอันดับหนึ่ง อัลกอริทึมค่าเหมาะที่สุดอันดับสอง อัลกอริทึมเคลื่อนลงตามความชันสโตแคสติก อัลกอริทึมเคลื่อนลงแบบใกล้เคียง การใช้โปรแกรมไพธอนในการพัฒนาอัลกอริทึม",
            "clos": [
                "อธิบายหลักการพื้นฐานของปัญหาการหาค่าเหมาะที่สุดแบบมีข้อจำกัด ไม่มีข้อจำกัด ปรับเรียบ ไม่ปรับเรียบและความเกี่ยวข้องกับการเรียนรู้ของเครื่องได้",
                "วิเคราะห์และเลือกอัลกอริทึมค่าเหมาะที่สุดอันดับหนึ่ง อัลกอริทึมค่าเหมาะที่สุดอันดับสอง อัลกอริทึมเคลื่อนลงตามความชันสโตแคสติก อัลกอริทึมเคลื่อนลงแบบใกล้เคียงเพื่อแก้ปัญหาการหาค่าเหมาะที่สุดได้",
                "พัฒนาอัลกอริทึมค่าเหมาะที่สุดโดยใช้ภาษาโปรแกรมได้",
                "วิเคราะห์และเลือกเทคนิคการหาค่าเหมาะที่สุดสำหรับการเรียนรู้ของเครื่องได้"
            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]
        },

        "09111705": {
            "title_en": "Data Structures and Algorithms for Machine Learning",
            "title_th": "โครงสร้างข้อมูลและอัลกอริทึมสำหรับการเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Concepts of data structures, fundamental data structures, operations of data structures, basic searching and sorting techniques, data structure analysis, applications and problem solving algorithms for machine learning processes.",
            "description_th": "แนวคิดของโครงสร้างข้อมูล โครงสร้างข้อมูลเบื้องต้น การดำเนินการบนโครงสร้างข้อมูล เทคนิคการค้นและเทคนิคการเรียงลำดับ การวิเคราะห์โครงสร้างข้อมูล การประยุกต์และอัลกอริทึมสำหรับการแก้ปัญหาในกระบวนการของการเรียนรู้ของเครื่อง",
            "clos": [
                "อธิบายหลักการและแนวคิดพื้นฐานของลิงก์ลิสต์ ทรีแบบทวิภาค ฮีป อาร์เรย์แบบพลวัต สแต็ก คิว เซต แฮชชิง กราฟได้",
                "วิเคราะห์และเลือกอัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมโปรแกรมเชิงพลวัต อัลกอริทึมแบบสุ่ม และอัลกอริทึมเชิงเส้นย่อยได้"
            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]
        },

        "09112601": {
            "title_en": "Functional Analysis",
            "title_th": "การวิเคราะห์เชิงฟังก์ชัน",
            "type": 2,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Metric space, normed space, Banach spaces, linear operator, inner product and Hilbert spaces, Hahn-Banach theorem, uniform boundedness theorem, dual space.",
            "description_th": "ปริภูมิเมตริก ปริภูมินอร์ม ปริภูมิบานาค ตัวดำเนินการเชิงเส้น ปริภูมิผลคูณภายในและปริภูมิฮิลเบิร์ต ทฤษฎีบทฮาห์น-บานาค ทฤษฎีบทการมีขอบเขตแบบเอกรูป ปริภูมิคู่กัน",
            "clos": [
                "อธิบายทฤษฎีบทที่เกี่ยวข้องกับปริภูมิฮิลเบิร์ตและปริภูมิบานาคได้",
                 "อธิบายทฤษฎีบทเกี่ยวกับตัวดำเนินการเชิงเส้นและปริภูมิคู่กัน",
                  "อธิบายทฤษฎีที่เกี่ยวข้องกับทฤษฎีบทฮาห์น-บานาคและทฤษฎีบทการมีขอบเขตแบบเอกรูป"

            ],
            "los_mapping": [2, 10],
            "plos_mapping": [2, 10]
        },


        "09112702": {
            "title_en": "Fixed Point Theory and Applications",
            "title_th": "ทฤษฎีจุดตรึงและการประยุกต์",
            "type": 2,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Fixed point theory in metric space, fixed point theory in Hilbert space, fixed point theory in Banach space, fixed point iteration.",
            "description_th": "ทฤษฎีจุดตรึงในปริภูมิเมตริก ทฤษฎีจุดตรึงในปริภูมิฮิลเบิร์ต ทฤษฎีจุดตรึงในปริภูมิบานาค การทำซ้ำเพื่อหาจุดตรึง",
            "clos": [
                "อธิบายทฤษฎีบทที่เกี่ยวข้องจุดตรึงในปริภูมิเมตริก ปริภูมิฮิลเบิร์ตและปริภูมิบานาคได้",
                "อธิบายทฤษฎีบทที่เกี่ยวกับการลู่เข้าของการทำซ้ำได้",
                "สร้างและพัฒนากระบวนการทำซ้ำเพื่อหาจุดตรึงในปริภูมิต่างๆได้ รวมทั้งพิสูจน์ทฤษฎีบทการลู่เข้า"
            ],
            "los_mapping": [2, 10],
            "plos_mapping": [2, 10]
        },

        "09113601": {
            "title_en": "Advanced Mathematics for Machine Learning",
            "title_th": "คณิตศาสตร์ขั้นสูงสำหรับการเรียนรู้ของเครื่อง",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Calculus for machine learning: multivariable functions, limit and continuity, derivative of multivariable functions, chain rule, Jacobian, gradient of vector-valued function, gradient of matrices, high order derivatives and Taylor’s Theorem. Neural networks: activation functions, loss function, backpropagation algorithm. Ordinary differential equations (ODEs) and basic theory: Prediction with model of ODEs. Partial differential equations (PDEs) and basic theory: Model of PDEs, prediction with model of PDEs.",
            "description_th": "แคลคูลัสสำหรับการเรียนรู้ของเครื่อง: ฟังก์ชันหลายตัวแปร ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชันหลายตัวแปร กฎลูกโซ่ จาโคเบียน เกรเดียนของฟังก์ชันค่าเวกเตอร์ เกรเดียนของเมทริกซ์ อนุพันธ์อันดับสูง ทฤษฎีของเทย์เลอร์ โครงข่ายประสาทเทียม ฟังก์ชันกระตุ้น ฟังก์ชันการสูญเสีย อัลกอริทึมเพิ่มประสิทธิภาพเพื่อปรับปรุงความแม่นยำของเครือข่ายประสาทเทียม สมการเชิงอนุพันธ์สามัญและทฤษฎีพื้นฐาน การพยากรณ์ข้อมูลด้วยแบบจำลองของสมการเชิงอนุพันธ์สามัญ สมการเชิงอนุพันธ์ย่อยและทฤษฎีพื้นฐาน แบบจำลองของสมการเชิงอนุพันธ์ย่อย การพยากรณ์ข้อมูลด้วยแบบจำลองของสมการเชิงอนุพันธ์ย่อย",
            "clos": [
                "อธิบายการหาลิมิต ความต่อเนื่องและอนุพันธ์ของฟังก์ชันหลายตัวแปรได้",
                 "อธิบายหลักการของโครงข่ายประสาทเทียมได้",
                  "อธิบายทฤษฎีพื้นฐานและการหาผลเฉลยของสมการเชิงอนุพันธ์สามัญและสมการเชิงอนุพันธ์ย่อยได้",
                  "ประยุกต์ใช้ตัวแบบจำลองของสมการเชิงอนุพันธ์ในการพยากรณ์ข้อมูลได้",
                   "ใช้เครื่องมือมาช่วยในการคำนวณเพื่อแก้ปัญหาทางคณิตศาสตร์ได้"
            ],
            "los_mapping": [2, 10],
            "plos_mapping": [2, 10]
        },


        "09113702": {
            "title_en": "Numerical Algorithm for Optimization",
            "title_th": "ขั้นตอนวิธีเชิงตัวเลขสำหรับค่าเหมาะที่สุด ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Optimization in Hilbert and Banach spaces, algorithm for fixed point, inertial method, variational inequality problem, equilibrium problem, quasi-inclusion problem, split feasibility problem, construction algorithm for solution of optimization problems.",
            "description_th": "ทฤษฎีค่าเหมาะที่สุดในปริภูมิฮิลเบิร์ตและปริภูมิบานาค ขั้นตอนวิธีสำหรับจุดตรึง วิธีอินเนอร์เทียล ปัญหาอสมการเชิงแปรผัน ปัญหาดุลยภาพ ปัญหารวมแบบกึ่ง ปัญหาเป็นไปได้แบบแยก การสร้างขั้นตอนวิธีเพื่อหาผลเฉลยของปัญหาค่าเหมาะที่สุด",
            "clos": [
                "อธิบายทฤษฎีที่เกี่ยวข้องการหารหาค่าเหมาะที่สุดในปริภูมิฮิลเบิร์ตและปริภูมิบานาค",
                "อธิบายความสัมพันธ์ของปัญหาต่างๆในทฤษฎีการหาค่าเหมาะสมที่สุดได้",
                "สร้างและพัฒนาขั้นตอนวิธีสำหรับจุดตรึงเพื่อหาผลเฉลยของปัญหาค่าเหมาะที่สุด",
                "ใช้เครื่องมือมาช่วยคำนวณการทำซ้ำเพื่อแก้ปัญหาค่าเหมาะที่สุดได้"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]
        },

        "09113603": {
            "title_en": "Intelligence Decision Making with Operation Research",
            "title_th": "การตัดสินใจอย่างชาญฉลาดด้วยกำหนดการวิจัยดำเนินงาน",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Linear programming: linear programming model and graphical solution, principles of the simplex method, dual problem and sensitivity analysis, principles of the dual simplex method, transportation models and its applications, logistics problems, network problems, investment problems, dynamic programming, development to operation research as an application to assist decision making.",
            "description_th": "กำหนดการเชิงเส้น: ตัวแบบกำหนดการเชิงเส้นและการหาผลเฉลยโดยวิธีกราฟ หลักการของวิธีซิมเพล็กซ์ ปัญหาควบคู่และการวิเคราะห์ความไว หลักการของวิธีซิมเพล็กซ์ควบคู่ ปัญหาการขนส่ง ปัญหาเครือข่าย ปัญหาการลงทุน กำหนดการพลวัต การพัฒนาแอพพลิเคชั่นช่วยตัดสินใจในการแก้ปัญหาโดยใช้การวิจัยดำเนินงาน",
            "clos": [
                "อธิบายหลักการของกำหนดการเชิงเส้นและการหาผลเฉลย",
                "อธิบายหลักการของปัญหาการขนส่ง ปัญหาเครือข่าย ปัญหาการลงทุน",
                "อธิบายการใช้กำหนดการพลวัตได้",
                "พัฒนาแอพพลิเคชั่นช่วยตัดสินใจในการแก้ปัญหาได้"
            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]

        },

        "09113704": {
            "title_en": "Special Topic in Computational Mathematics for Machine Learning",
            "title_th": "หัวข้อพิเศษของคณิตศาสตร์เชิงคำนวณ ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Theoretical advances and applications of computational mathematics for machine learning, specific topics based on contemporary advances in science and technology, interests of individual instructor and students.",
            "description_th": "ความก้าวหน้าเชิงทฤษฎีและการประยุกต์คณิตศาสตร์เชิงคำนวณสำหรับการเรียนรู้ของเครื่อง เรื่องเฉพาะแปรเปลี่ยนตามความสนใจของผู้สอนและนักศึกษา ซึ่งสอดคล้องกับ ความก้าวหน้าทางวิทยาศาสตร์และเทคโนโลยีในปัจจุบัน",
            "clos": [
                "อธิบายองค์ความรู้ด้านการประยุกต์คณิตศาสตร์เชิงคำนวณสำหรับการเรียนรู้ของเครื่องในปัจจุบันได้",
                "ประยุกต์องค์ความรู้ในการแก้ปัญหาได้อย่างเหมาะสม"

            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]

        },

        "09114701": {
            "title_en": "Deep Learning and Applications",
            "title_th": "การเรียนรู้เชิงลึกและการประยุกต์  ",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Fundamentals of neural networks, feed-forward and backpropagation learning, implementation with frameworks such as tensor flow or PyTorch, convolutional neural networks, recurrent neural networks, techniques to prevent overfitting, hyperparameter tuning, applications in image processing, and natural language processing.",
            "description_th": "พื้นฐานโครงข่ายประสาทเทียม การเรียนรู้แบบป้อนหน้าและการแพร่กลับ การใช้งานเฟรมเวิร์กเช่น TensorFlow หรือ PyTorch โครงข่ายประสาทแบบคอนโว ลูชัน โครงข่ายประสาทแบบหมุนเวียน เทคนิคป้องกันการฟิตเกิน การปรับจูนไฮ เปอร์พารามิเตอร์ การประยุกต์ใช้ในการประมวลผลภาพ และการประมวลผลภาษาธรรมชาติ",
            "clos": [
                "เลือกใช้แบบจำลองให้เหมาะสมกับปัญหาที่หลากหลายได้อย่างเหมาะสม",
                 "อธิบายการใช้เทคนิคโครงข่ายประสาทเทียมแบบประสานและโครงข่ายประสาทเทียมแบบวนซ้ำได้",
                  "สร้างหรือพัฒนาอัลกอริทึมการเรียนรู้เชิงลึกเพื่อใช้แก้ปัญหาต่างๆได้",
                  "ออกแบบ สร้างหรือพัฒนาเว็บแอพพลิเคชั่นสำหรับการเรียนรู้ในเชิงลึกได้"
          
            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]
        },


        "09114702": {
            "title_en": "Machine Learning Engineering and Data Scraping",
            "title_th": "วิศวกรรมการเรียนรู้ของเครื่องและการดึงข้อมูล",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Principles of Machine learning engineering, process and design of machine learning, machine learning development and deployment, data scraping for machine learning, machine learning web application development.",
            "description_th": "หลักการของวิศวกรรมการเรียนรู้ของเครื่อง กระบวนการและการออกแบบการเรียนรู้ของเครื่อง การพัฒนาและการปรับใช้การเรียนรู้ของเครื่อง การดึงข้อมูลสำหรับการเรียนรู้ของเครื่อง การพัฒนาเว็บแอพพลิเคชั่นเพื่องานการเรียนรู้ของเครื่อง ",
            "clos": [
                "อธิบายแนวคิดพื้นฐาน กระบวนการ และหลักการออกแบบระบบการเรียนรู้ของเครื่องได้",
                "ออกแบบและพัฒนาระบบการเรียนรู้ของเครื่องได้",
                "ดึงและจัดเตรียมข้อมูลสำหรับการเรียนรู้ของเครื่องได้",
                "ออกแบบ สร้างหรือพัฒนาเว็บแอพพลิเคชั่นเพื่องานการเรียนรู้ของเครื่องได้"
            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]
        },

        "09114603": {
            "title_en": "Data Analytics",
            "title_th": "การวิเคราะห์ข้อมูล",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Technologies used in manipulating, storing, and analyzing big data, clustering data, path analysis, factor analysis and structural equation model, utilization of software packages or programming language for analysis.",
            "description_th": "เทคโนโลยีในการจัดการเก็บและวิเคราะห์ข้อมูลขนาดใหญ่ การจัดกลุ่มข้อมูล การวิเคราะห์เส้นทาง การวิเคราะห์ปัจจัย และตัวแบบสมการโครงสร้าง การใช้โปรแกรมสำเร็จรูปหรือภาษาโปรแกรมในการวิเคราะห์",
            "clos": [
                "อธิบายแนวคิดพื้นฐานและหลักการของเก็บและจัดกลุ่มข้อมูลขนาดใหญ่ได้",
                "ใช้เครื่องมือและเทคโนโลยีที่ทันสมัยเพื่อวิเคราะห์ข้อมูลขนาดใหญ่ได้"
            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]

        },

        "09114604": {
            "title_en": "Data Visualization",
            "title_th": "การทำให้เห็นข้อมูล",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Coordinate systems and axes, color scales, visualizing amounts, visualizing distributions, visualizing proportions, visualizing time series, visualizing trends, visualizing uncertainty, principles of figure design, the principle of proportional ink, and handling overlapping points.",
            "description_th": "ระบบพิกัดและแกน สเกลสี การแสดงภาพจำนวน การแสดงภาพการกระจาย การแสดงภาพสัดส่วน การแสดงภาพอนุกรมเวลา การแสดงภาพแนวโน้ม การแสดงภาพความไม่แน่นอน หลักการออกแบบภาพ เช่น หลักการของน้ำหมึกตามสัดส่วน และการจัดการจุดที่ทับซ้อนกัน",
            "clos": [
                "อธิบายแนวคิดพื้นฐานและหลักการของการทำให้เห็นข้อมูลได้",
                "ออกแบบการแสดงภาพที่จากชุดข้อมูลที่ซับซ้อนได้",
                "ใช้เครื่องมือและเทคโนโลยีที่ทันสมัยแสดงภาพจากชุดข้อมูลขนาดใหญ่ให้สื่อสารและเข้าใจง่ายขึ้นได้"

            ],
            "los_mapping": [1, 6, 10],
            "plos_mapping": [1, 6, 10]
        },

        "09114705": {
            "title_en": "Applications of Machine Learning in Natural Language Processing",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านการประมวลภาษาธรรมชาติ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Definition and characteristic of natural language processing (NLP), text pre-processing, semantic and grammatical analysis, features extraction, TF-IDF model, word and document vectors, speech recognition and synthesis, application of NLP to classification, information extraction, text mining and information retrieval, application of deep learning to NLP, neural networks in NLP.",
            "description_th": "ความหมายและลักษณะของงานด้านการประมวลภาษาธรรมชาติ การประมวลผลข้อความล่วงหน้า การวิเคราะห์ความหมายและไวยากรณ์ การแยกคุณสมบัติ รูปแบบ TF-IDF รูปแบบของคำและเอกสารที่เป็นเวกเตอร์ การรู้จําและการสังเคราะห์เสียง การประยุกต์ NLP ในการจำแนก การสกัดข้อมูล การขุดและการดึงข้อความ การประยุกต์การเรียนรู้เชิงลึกใน NLP โครงข่ายประสาทเทียมใน NLP",
            "clos": [
                "อธิบายหลักการใช้การเรียนรู้ของเครื่องในงานด้านการประมวลภาษาธรรมชาติได้",
                "สร้างระบบการประมวลผลข้อความ ความหมายและไวยกรณ์ได้",
                "ใช้เครื่องมือและเทคโนโลยีที่ทันสมัยเพื่อสร้างเว็บแอพพลิเคชั่นสำหรับเนื้อหา ความรู้และการสนทนาได้"

            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]

        },

        "09114706": {
            "title_en": "Applications of Machine Learning in Image and Signal Processing",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านประมวลผลภาพและสัญญาณ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Applications of Machine Learning in Image and signal processing: machine learning for analyze image and signal. Image deblurring problem, Gaussian blur, motion blur, out of focus blur, noise reduction, image and signal compression, image preprocessing and augmentation techniques.",
            "description_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านประมวลผลภาพและสัญญาณ เช่น การใช้การเรียนรู้ของเครื่องสำหรับวิเคราะห์ภาพถ่ายและสัญญาณ ปัญหาภาพเบลอ ภาพเบลอแบบเกาส์เซียน ภาพเบลอแบบเคลื่อนไหว ภาพเบลอแบบหลุดความสนใจ การกำจัดสัญญาณรบกวน การบีบอัดภาพและสัญญาณ เทคนิคการประมวลผลภาพล่วงหน้าและการเพิ่มภาพ ",
            "clos": [
                "อธิบายหลักการใช้การเรียนรู้ของเครื่องในงานด้านประมวลภาพและสัญญาณได้",
                "อธิบายการประเภทของปัญหาภาพเบลอและการกำจัดสัญญาณรบกวนของภาพเบลอแบบต่างๆได้",
                "อธิบายการใช้เทคนิคเครือข่ายประสาทเทียมแบบประสานกับงานด้านประมวลภาพและสัญญาณได้",
              "สร้างอัลกอรึทึมการเรียนรู้สำหรับการแก้ปัญหาภาพเบลอได้",
             "ประยุกต์ใช้เครื่องมือการเรียนรู้ของเครื่องช่วยในการตัดสินใจในการแก้ปัญหาจริงได้",
             "ออกแบบ สร้างหรือพัฒนาเว็บแอพพลิเคชั่นการเรียนรู้ในงานด้านประมวลภาพและสัญญาณได้"
            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]

        },

        "09114707": {
            "title_en": "Applications of Machine Learning in Medical",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านการแพทย์ ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Application of machine learning in the medical: machine learning for disease diagnosis and identifying the types of diseases, data analytic of medical big data.",
            "description_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในด้านการแพทย์ เช่น การใช้การเรียนรู้ของเครื่องสำหรับการวินิจฉัยโรค การใช้การเรียนรู้ของเครื่องสำหรับการระบุชนิดของโรค การวิเคราะห์ข้อมูลขนาดใหญ่ทางการแพทย์",
            "clos": [
                "อธิบายหลักการใช้การเรียนรู้ของเครื่องในงานด้านการแพทย์ได้",
                "วิเคราะห์ข้อมูลขนาดใหญ่ทางการแพทย์ได้",
                "สร้างอัลกอรึทึมการเรียนรู้สำหรับการวินิจฉัยโรคได้",
              "ประยุกต์ใช้เครื่องมือการเรียนรู้ของเครื่องช่วยในการตัดสินใจในการแก้ปัญหาจริงได้",
             "ออกแบบ สร้างหรือพัฒนาเว็บแอพพลิเคชั่นการเรียนรู้ในงานด้านการแพทย์ได้"
            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]
        },

        "09114708": {
            "title_en": "Applications of Machine Learning in Business and Finance",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในด้านธุรกิจและการเงิน",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Application of machine learning in business and finance: machine learning for stock trend analysis and making business decisions.",
            "description_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านธุรกิจและการเงิน เช่น การใช้การเรียนรู้ของเครื่องสำหรับการวิเคราะห์แนวโน้มของหุ้น การใช้การเรียนรู้ของเครื่องสำหรับการตัดสินใจทางธุรกิจ",
            "clos": [
                "อธิบายหลักการใช้การเรียนรู้ของเครื่องในงานด้านธุรกิจและการเงิน",
                "สร้างอัลกอรึทึมการเรียนรู้สำหรับการการตัดสินใจทางธุรกิจและการลงทุน",
                "ประยุกต์ใช้เครื่องมือการเรียนรู้ของเครื่องช่วยในการตัดสินใจในการแก้ปัญหาจริงได้",
              "ออกแบบ สร้างหรือพัฒนาเว็บแอพพลิเคชั่นการเรียนรู้ในงานด้านธุรกิจและการเงินได้"

            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]
        },

        "09114709": {
            "title_en": "Special Topic in Machine Learning",
            "title_th": "หัวข้อพิเศษของการเรียนรู้ของเครื่อง ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Theoretical advances for applications of machine learning, specific topics based on contemporary advances in science and technology, interests of individual instructor and students.",
            "description_th": "ความก้าวหน้าของการประยุกต์ใช้การเรียนรู้ของเครื่อง เรื่องเฉพาะแปรเปลี่ยนตามความสนใจของผู้สอนและนักศึกษา ซึ่งสอดคล้องกับ ความก้าวหน้าทางวิทยาศาสตร์และเทคโนโลยีในปัจจุบัน ",
            "clos": [
                "อธิบายองค์ความรู้ด้านการเรียนรู้ของเครื่องในปัจจุบันได้",
                "ประยุกต์องค์ความรู้ในการแก้ปัญหาได้อย่างเหมาะสม"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]

        },

        "09115701": {
            "title_en": "Independent Study",
            "title_th": "สารนิพนธ์",
            "type": 5,
            "group": 1,
            "credits": 6,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Students are expected to complete at least 10 credits of study with approval from advisors. This must be related with the subject or knowledge, which students have learned from the courses.",
            "description_th": "นักศึกษาที่จะทำสารนิพนธ์จะต้องผ่านวิชาบังคับในหลักสูตรอย่างน้อย 10 หน่วยกิต หรือตามที่ภาควิชาฯ เห็นชอบ หัวข้อสารนิพนธ์จะต้องได้รับการเห็นชอบจากอาจารย์ที่ปรึกษาและภาควิชาฯ และต้องเป็นหัวข้อที่เกี่ยวข้องกับเนื้อหาวิชาที่ได้เรียนมาในหลักสูตร ",
            "clos": [
                "ศึกษา ค้นคว้าและอธิบายองค์ความรู้จากงานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้",
                "ออกแบบกระบวนการทำวิจัยและดำเนินการทำวิจัยได้อย่างถูกต้องตามหลักจริยธรรมของการวิจัยและจรรยาบรรณของนักวิจัย",
                "ประมวลองค์ความรู้งานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้ รวมถึงประยุกต์ใช้เทคโนโลยีและองค์ความรู้ที่จากงานวิจัยเพื่อการแก้ปัญหาหรือพัฒนานวัตกรรมได้",
                "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "plos_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
        },

        "09115702": {
            "title_en": "Thesis",
            "title_th": "วิทยานิพนธ์",
            "type": 5,
            "group": 1,
            "credits": 12,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Students are required to conduct a thesis under supervision of advisors appointed by graduate college. Rules and regulations for under taking thesis set by students’ department and graduate college must be observed strictly.",
            "description_th": "นักศึกษาต้องทำวิทยานิพนธ์ภายใต้คำแนะนำของอาจารยที่ปรึกษาที่ได้รับการแต่ง ตั้งโดยบัณฑิตวิทยาลัย นักศึกษาต้องปฏิบัติตามกูฏและข้อบังคับที่กำหนดโดยภาควิชาและบัณฑิตวิทยาลัยอย่างเคร่งครัด",
            "clos": [
                "ศึกษา ค้นคว้าและอธิบายองค์ความรู้จากงานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้",
                "ออกแบบกระบวนการทำวิจัยและดำเนินการทำวิจัยได้อย่างถูกต้องตามหลักจริยธรรมของการวิจัยและจรรยาบรรณของนักวิจัย",
                "สร้างหรือพัฒนาองค์ความรู้งานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้ รวมถึงประยุกต์ใช้เทคโนโลยีและองค์ความรู้ที่จากงานวิจัยเพื่อการแก้ปัญหาหรือพัฒนานวัตกรรมได้",
                "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "plos_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
        },

        "09115703": {
            "title_en": "Thesis",
            "title_th": "วิทยานิพนธ์",
            "type": 5,
            "group": 1,
            "credits": 36,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Students are required to conduct a thesis under supervision of advisors appointed by graduate college. Rules and regulations for under taking thesis set by students’ department and graduate college must be observed strictly.",
            "description_th": "นักศึกษาต้องทำวิทยานิพนธ์ภายใต้คำแนะนำของอาจารยที่ปรึกษาที่ได้รับการแต่ง ตั้งโดยบัณฑิตวิทยาลัย นักศึกษาต้องปฏิบัติตามกูฏและข้อบังคับที่กำหนดโดยภาควิชาและบัณฑิตวิทยาลัยอย่างเคร่งครัด",
            "clos": [
                "ศึกษา ค้นคว้าและอธิบายองค์ความรู้จากงานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้",
                 "ออกแบบกระบวนการทำวิจัยและดำเนินการทำวิจัยได้อย่างถูกต้องตามหลักจริยธรรมของการวิจัยและจรรยาบรรณของนักวิจัย",
                  "สร้างหรือพัฒนาองค์ความรู้งานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้ รวมถึงประยุกต์ใช้เทคโนโลยีและองค์ความรู้ที่จากงานวิจัยเพื่อการแก้ปัญหาหรือพัฒนานวัตกรรมได้",
                  "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "plos_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
        }

    }
}