{
    "courses": {

        "09110601": {
            "title_en": "Data Digitalization",
            "title_th": "การนำเข้าข้อมูลสู่รูปแบบดิจิทัล",
            "type": 0,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Data manipulation, data storage, basic data analysis, coordinate systems, axes, color scales, figure design, information visualization, digital transformation fundamentals, structured data integration, visualization techniques",
            "description_th": "การจัดการข้อมูล, การเก็บข้อมูล, การวิเคราะห์ข้อมูลพื้นฐาน, ระบบพิกัด, แกน, สเกลสี, การออกแบบภาพ, การแสดงข้อมูล, หลักการเปลี่ยนแปลงข้อมูลดิจิทัล, การบูรณาการข้อมูล, เทคนิคการแสดงผล",
            "clos": [
                "เข้าใจหลักการพื้นฐานของการจัดการและนำเสนอข้อมูลในรูปแบบดิจิทัล",
                "ประยุกต์ใช้เทคโนโลยีสมัยใหม่ในการจัดการและแสดงผลข้อมูล",
                "ออกแบบการนำเสนอข้อมูลที่มีประสิทธิภาพและชัดเจน"
            ],
            "los_mapping": [6, 8, 10],
            "plos_mapping": [6, 8, 10]
        },

        "09110702": {
            "title_en": "Seminar",
            "title_th": "สัมมนา",
            "type": 0,
            "group": 1,
            "credits": 1,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Seminar on articles selected from scientific journals focusing on topics concerning computational optimization and machine learning, the students are obliged to analyze, summaries, give an oral presentation, discuss, and answer the questions, required written report and presentation the selected topics.",
            "description_th": "ศึกษาค้นคว้าบทความที่อยู่ในฐานข้อมูลทางวิทยาศาสตร์ นำเสนอผลการวิจัย วิเคราะห์ อภิปราย สรุปผล ตั้ง คำถามและตอบคำถามจากผู้ร่วมสัมมนาได้ นักศึกษาต้องเขียนรายงานและนำเสนอต่อคณะกรรมการของสาขาวิชา",
            "clos": [
                "อธิบายบทความวิจัยที่เกี่ยวข้องกับการคำนวณเชิงคณิตศาสตร์หรือการเรียนรู้ของเครื่องในปัจจุบันได้",
                "วิเคราะห์ อภิปราย สรุปผล และตอบคำถามจากผู้เข้าร่วมสัมมนาได้ ",
                "นำเสนอหัวข้อที่เลือกในรูปแบบภาษาไทยและภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 6, 8, 10],
            "plos_mapping": [1, 2, 6, 8, 10]
        },

        "09111601": {
            "title_en": "Statistics and Probability for Machine Learning",
            "title_th": "สถิติและความน่าจะเป็นสำหรับการเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Basic theories in statistics for machine learning, probability, discrete random variables, continuous random variables, joint distributions, expectation, conditional expectation, statistical limit theorems, estimation of parameters, maximum likelihood estimation, Bayesian approach to parameter estimation, hypothesis testing, confidence intervals, random processes.",
            "description_th": "ทฤษฎีพื้นฐานในสถิติสำหรับการเรียนรู้ของเครื่อง ความน่าจะเป็น ตัวแปรสุ่มแบบไม่ต่อเนื่อง ตัวแปรสุ่มแบบต่อเนื่อง การแจกแจงร่วม ค่าคาดหวัง ค่าคาดหวังแบบมีเงื่อนไข ทฤษฎีลิมิตทางสถิติ การประมาณค่าพารามิเตอร์ การประมาณภาวะน่าจะเป็นสูงสุด วิธีการแบบเบย์ในการประมาณค่าพารามิเตอร์ การทดสอบสมมติฐาน ช่วงความเชื่อมั่น กระบวนการเฟ้นสุ่ม",
            "clos": [
                "คำนวณความน่าจะเป็นของเหตุการณ์ต่าง ๆ โดยใช้เทคนิคสถิติที่เหมาะสม",
                "อธิบายความหมายของค่าคาดหวังแบบมีเงื่อนไขสำหรับตัวแปรสุ่มทั้งแบบไม่ต่อเนื่องและแบบต่อเนื่อง",
                "คำนวณค่าคาดหวังแบบมีเงื่อนไขสำหรับตัวแปรสุ่มแบบไม่ต่อเนื่อง",
                "คำนวณค่าคาดหวังแบบมีเงื่อนไขสำหรับตัวแปรสุ่มแบบต่อเนื่อง"
            ],
            "los_mapping": [2, 10],
            "plos_mapping": [2, 10]
        },


        "09111602": {
            "title_en": "Mathematics for Machine Learning",
            "title_th": "คณิตศาสตร์สำหรับการเรียนรู้ของเครื่อง",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Matrices and matrix algebra, system of linear equation and solving systems of linear equations, vector space, linear Independence, basis, orthonormal basis, linear transformation, eigen value and eigen vector, diagonalization of matrices, norm, inner product, lengths and distances, orthogonal complement, matrice spaces",
            "description_th": "เมทริกซ์และการดำเนินการบนเมทริกซ์ ระบบสมการเชิงเส้นและการหาผลเฉลย ปริภูมิเวกเตอร์ ความเป็นอิสระเชิงเส้น ฐานหลัก ฐานหลักเชิงตั้งฉาก การแปลงเชิงเส้น ค่าเจาะจงและเวกเตอร์เจาะจง การทำให้เป็นเมทริกซ์ทแยงมุม นอร์ม ผลคูณภายใน ความยาวและระยะทาง ส่วนประกอบเชิงตั้งฉาก ปริภูมิเมตริก ",
            "clos": [
                "หาผลเฉลยของระบบสมการเชิงเส้น",
                "จำแนกความเป็นอิสระเชิงเส้นของเวกเตอร์",
                "คำนวณมิติของปริภูมิเวกเตอร์",
                "หาค่าเจาะจงและเวกเตอร์เจาะจงของเมตริกซ์ได้",
                "หาความยาว ระยะทาง และส่วนประกอบเชิงตั้งฉากของเวกเตอร์",
                "ใช้เครื่องมือช่วยการคำนวณเพื่อแก้ปัญหาทางเวกเตอร์และเมทริกซ์"
            ],
            "los_mapping": [1, 2, 10],
            "plos_mapping": [1, 2, 10]
        },

        "09111603": {
            "title_en": "Machine Learning 1",
            "title_th": "การเรียนรู้ของเครื่อง 1",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Concepts and principles of machine learning, data preparation, learning algorithm, such as linear regression, multiple linear regression, logistic regression, k-nearest neighbors, decision tree. Model evaluation, application model to forecasting and data classification.",
            "description_th": "แนวคิดและหลักการของการเรียนรู้ของเครื่อง การเตรียมข้อมูล ขั้นตอนการเรียนรู้ เช่น การถดถอยเชิงเส้น การถดถอยเชิงเส้นพหุคูณ การถดถอยโลจีสติกส์ ย่านใกล้เคียงที่สุดเค เบย์อย่างง่าย ต้นไม้ตัดสินใจ การทดสอบประสิทธิภาพตัวแบบ การใช้ตัวแบบไปประยุกต์ใช้ในการพยากรณ์และการจำแนกข้อมูล",
            "clos": [
                "อธิบายแนวคิดและหลักการของการเรียนรู้ของเครื่องได้",
                "อธิบายการเลือกใช้อัลกอริทึมแบบมีผู้สอนที่เหมาะสมสำหรับข้อมูลที่มีความหลากหลายได้",
                "สร้างหรือพัฒนาแบบอัลกอริทึมแบบมีผู้สอนในการพยากรณ์และการจำแนกข้อมูลได้",
                "วิเคราะห์ประสิทธิภาพของอัลกอริทึมแบบมีผู้สอนได้",
                "ใช้เครื่องมือการเรียนรู้ของเครื่องช่วยในการตัดสินใจในการแก้ปัญหาจริงได้"
            ],
            "los_mapping": [1, 2, 5, 6, 10],
            "plos_mapping": [1, 2, 5, 6, 10]

        },

        "09113601": {
            "title_en": "Optimization for Machine Learning",
            "title_th": "การหาค่าเหมาะที่สุดสำหรับการเรียนรู้ของเครื่อง",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Basic theories of optimization, constrained optimization, unconstrained optimization, smooth and nonsmooth optimization, first-order optimization algorithms, second-order optimization algorithms, stochastic gradient descent algorithm, proximal gradient method",
            "description_th": "ทฤษฎีพื้นฐานของปัญหาการหาค่าเหมาะที่สุด ปัญหาการหาค่าเหมาะที่สุดแบบมีข้อจำกัด ปัญหาการหาค่าเหมาะที่สุดแบบไม่มีข้อจำกัด ปัญหาการหาค่าเหมาะที่สุดแบบปรับเรียบ และไม่ปรับเรียบ อัลกอริทึมค่าเหมาะที่สุดอันดับหนึ่ง อัลกอริทึมค่าเหมาะที่สุดอันดับสอง อัลกอริทึมเคลื่อนลงตามความชันสโตแคสติก อัลกอริทึมเคลื่อนลงแบบใกล้เคียง",
            "clos": [
                "อธิบายหลักการพื้นฐานของปัญหาการหาค่าเหมาะที่สุดแบบมีข้อจำกัด ไม่มีข้อจำกัด ปรับเรียบ ไม่ปรับเรียบและความเกี่ยวข้องกับการเรียนรู้ของเครื่องได้",
                "วิเคราะห์และเลือกอัลกอริทึมค่าเหมาะที่สุดอันดับหนึ่ง อัลกอริทึมค่าเหมาะที่สุดอันดับสอง อัลกอริทึมเคลื่อนลงตามความชันสโตแคสติก อัลกอริทึมเคลื่อนลงแบบใกล้เคียงเพื่อแก้ปัญหาการหาค่าเหมาะที่สุดได้",
                "วิเคราะห์และเลือกเทคนิคการหาค่าเหมาะที่สุดสำหรับการเรียนรู้ของเครื่องได้"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]
        },

        "09114701": {
            "title_en": "Data Structures and Algorithms for Machine Learning",
            "title_th": "โครงสร้างข้อมูลและอัลกอริทึมสำหรับการเรียนรู้ของเครื่อง",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Concepts of data structures, fundamental data structures, operations of data structures, basic searching and sorting techniques, data structure analysis, applications and problem solving algorithms for machine learning processes.",
            "description_th": "แนวคิดของโครงสร้างข้อมูล โครงสร้างข้อมูลเบื้องต้น การดำเนินการบนโครงสร้างข้อมูล เทคนิคการค้นและเทคนิคการเรียงลำดับ การวิเคราะห์โครงสร้างข้อมูล การประยุกต์และอัลกอริทึมสำหรับการแก้ปัญหาในกระบวนการของการเรียนรู้ของเครื่อง",
            "clos": [
                "อธิบายหลักการและแนวคิดของลิงก์ลิสต์ ทรีแบบทวิภาค ฮีป อาร์เรย์แบบพลวัต สแต็ก คิว เซต แฮชชิง และ กราฟ",
                "วิเคราะห์และเลือกอัลกอริทึมการเรียงลำดับและค้นหาข้อมูล อัลกอริทึมโปรแกรมเชิงพลวัต อัลกอริทึมแบบสุ่ม และอัลกอริทึมเชิงเส้นย่อยให้เหมาะสมกับปัญหา"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]
        },

        "09112601": {
            "title_en": "Functional Analysis",
            "title_th": "การวิเคราะห์เชิงฟังก์ชัน",
            "type": 2,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Metric space, normed space, Banach spaces, linear operator, inner product and Hilbert spaces, Hahn-Banach theorem, uniform boundedness theorem, dual space.",
            "description_th": "ปริภูมิเมตริก ปริภูมินอร์ม ปริภูมิบานาค ตัวดำเนินการเชิงเส้น ปริภูมิผลคูณภายในและปริภูมิฮิลเบิร์ต ทฤษฎีบทฮาห์น-บานาค ทฤษฎีบทการมีขอบเขตแบบเอกรูป ปริภูมิคู่กัน",
            "clos": [
                "อธิบายทฤษฎีบทที่เกี่ยวข้องกับปริภูมิฮิลเบิร์ตและปริภูมิบานาค",
                "อธิบายทฤษฎีบทเกี่ยวกับตัวดำเนินการเชิงเส้นและปริภูมิคู่กัน",
                "อธิบายทฤษฎีบทฮาห์น-บานาค",
                "อธิบายทฤษฎีบทการมีขอบเขตแบบเอกรูป"
            ],
            "los_mapping": [2, 10],
            "plos_mapping": [2, 10]
        },


        "09112702": {
            "title_en": "Fixed Point Theory and Applications",
            "title_th": "ทฤษฎีจุดตรึงและการประยุกต์",
            "type": 2,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Fixed point theory in metric space, fixed point theory in Hilbert space, fixed point theory in Banach space, fixed point iteration.",
            "description_th": "ทฤษฎีจุดตรึงในปริภูมิเมตริก ทฤษฎีจุดตรึงในปริภูมิฮิลเบิร์ต ทฤษฎีจุดตรึงในปริภูมิบานาค การทำซ้ำเพื่อหาจุดตรึง",
            "clos": [
                "อธิบายทฤษฎีบทที่เกี่ยวข้องจุดตรึงในปริภูมิเมตริก",
                "อธิบายทฤษฎีบทที่เกี่ยวข้องจุดตรึงในปริภูมิฮิลเบิร์ต",
                "อธิบายทฤษฎีบทที่เกี่ยวข้องจุดตรึงในปริภูมิบานาค",
                "อธิบายทฤษฎีบทที่เกี่ยวกับการลู่เข้าของการทำซ้ำ",
                "พิสูจน์ทฤษฎีบทการลู่เข้าของการทำซ้ำ",
                "สร้างหรือพัฒนากระบวนการทำซ้ำเพื่อหาจุดตรึงในปริภูมิเมตริก ปริภูมิฮิลเบิร์ต และปริภูมิบานาค"
            ],
            "los_mapping": [2, 4, 10],
            "plos_mapping": [2, 4, 10]
        },

        "09113702": {
            "title_en": "Advanced Mathematics for Machine Learning",
            "title_th": "คณิตศาสตร์ขั้นสูงสำหรับการเรียนรู้ของเครื่อง",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "multivariable functions, limit and continuity, derivative of multivariable functions, chain rule, Jacobian, gradient of vector-valued function, gradient of matrices, high order derivatives and Taylor’s Theorem, artificial neural networks, activation functions, loss function, backpropagation algorithm, ordinary differential equations , partial differential equations, prediction models",
            "description_th": "ฟังก์ชันหลายตัวแปร ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชันหลายตัวแปร กฎลูกโซ่ จาโคเบียน เกรเดียนของฟังก์ชันค่าเวกเตอร์ เกรเดียนของเมทริกซ์ อนุพันธ์อันดับสูง ทฤษฎีของเทย์เลอร์ โครงข่ายประสาทเทียม ฟังก์ชันกระตุ้น ฟังก์ชันการสูญเสีย อัลกอริทึมเพิ่มประสิทธิภาพเพื่อปรับปรุงความแม่นยำของเครือข่ายประสาทเทียม สมการเชิงอนุพันธ์สามัญ สมการเชิงอนุพันธ์ย่อย การพยากรณ์ข้อมูลด้วยแบบจำลอง",
            "clos": [
                "หาลิมิตของฟังก์ชันหลายตัวแปรได้",
                "อธิบายความต่อเนื่องของฟังก์ชันหลายตัวแปรได้",
                "หาอนุพันธ์ของฟังก์ชันหลายตัวแปรได้",
                "อธิบายหลักการของโครงข่ายประสาทเทียมได้",
                "อธิบายทฤษฎีพื้นฐานและการหาผลเฉลยของสมการเชิงอนุพันธ์สามัญ",
                "อธิบายทฤษฎีพื้นฐานและการหาผลเฉลยของสมการเชิงอนุพันธ์ย่อยได้",
                "ประยุกต์ใช้ตัวแบบจำลองของสมการเชิงอนุพันธ์ในการพยากรณ์ข้อมูลได้",
                "ใช้เครื่องมือมาช่วยในการคำนวณเพื่อแก้ปัญหาทางการพยากรณ์ข้อมูลได้"
            ],
            "los_mapping": [2, 5, 10],
            "plos_mapping": [2, 5, 10]
        },


        "09113703": {
            "title_en": "Numerical Algorithm for Optimization",
            "title_th": "ขั้นตอนวิธีเชิงตัวเลขสำหรับค่าเหมาะที่สุด ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Optimization in Hilbert and Banach spaces, algorithm for fixed point, inertial method, variational inequality problem, equilibrium problem, quasi-inclusion problem, split feasibility problem, construction algorithm for solution of optimization problems.",
            "description_th": "ทฤษฎีค่าเหมาะที่สุดในปริภูมิฮิลเบิร์ตและปริภูมิบานาค ขั้นตอนวิธีสำหรับจุดตรึง วิธีอินเนอร์เทียล ปัญหาอสมการเชิงแปรผัน ปัญหาดุลยภาพ ปัญหารวมแบบกึ่ง ปัญหาเป็นไปได้แบบแยก การสร้างขั้นตอนวิธีเพื่อหาผลเฉลยของปัญหาค่าเหมาะที่สุด",
            "clos": [
                "อธิบายทฤษฎีที่เกี่ยวข้องการหารหาค่าเหมาะที่สุดในปริภูมิฮิลเบิร์ตและปริภูมิบานาค",
                "อธิบายความสัมพันธ์ของปัญหาต่างๆในทฤษฎีการหาค่าเหมาะสมที่สุดได้",
                "สร้างและพัฒนาขั้นตอนวิธีสำหรับจุดตรึงเพื่อหาผลเฉลยของปัญหาค่าเหมาะที่สุด",
                "ใช้เครื่องมือมาช่วยคำนวณการทำซ้ำเพื่อแก้ปัญหาค่าเหมาะที่สุดได้"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]
        },

        "09111704": {
            "title_en": "Intelligence Decision Making",
            "title_th": "การตัดสินใจอย่างชาญฉลาด",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Linear programming model and graphical solution, principles of the simplex method, dual problem and sensitivity analysis, principles of the dual simplex method, transportation models and its applications, logistics problems, network problems, investment problems, dynamic programming, integer programming, goal programming",
            "description_th": "ตัวแบบกำหนดการเชิงเส้นและการหาผลเฉลยโดยวิธีกราฟ หลักการของวิธีซิมเพล็กซ์ ปัญหาควบคู่และการวิเคราะห์ความไว หลักการของวิธีซิมเพล็กซ์ควบคู่ ปัญหาการขนส่ง ปัญหาเครือข่าย ปัญหาการลงทุน กำหนดการพลวัต กำหนดการจำนวนเต็ม กำหนดการเป้าหมาย",
            "clos": [
                "อธิบายหลักการของกำหนดการเชิงเส้นและการหาผลเฉลย",
                "เขียนตัวแบบของปัญหาการขนส่ง ปัญหาเครือข่าย หรือปัญหาการลงทุนในรูปแบบกำหนดการเชิงเส้น",
                "ใช้กำหนดการเชิงเส้นในการแก้ปัญหาปัญหาการขนส่ง ปัญหาเครือข่าย หรือปัญหาการลงทุน",
                "ใช้กำหนดการพลวัตในการแก้ปัญหาปัญหาการขนส่ง ปัญหาเครือข่าย หรือปัญหาการลงทุน",
                "พัฒนาแอพพลิเคชันช่วยตัดสินใจในการแก้ปัญหาได้"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]

        },

        "09113704": {
            "title_en": "Special Topic in Computational Mathematics for Machine Learning",
            "title_th": "หัวข้อพิเศษของคณิตศาสตร์เชิงคำนวณ ",
            "type": 3,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Theoretical advances and applications of computational mathematics for machine learning, specific topics based on contemporary advances in science and technology, interests of individual instructor and students.",
            "description_th": "ความก้าวหน้าเชิงทฤษฎีและการประยุกต์คณิตศาสตร์เชิงคำนวณสำหรับการเรียนรู้ของเครื่อง เรื่องเฉพาะแปรเปลี่ยนตามความสนใจของผู้สอนและนักศึกษา ซึ่งสอดคล้องกับ ความก้าวหน้าทางวิทยาศาสตร์และเทคโนโลยีในปัจจุบัน",
            "clos": [
                "อธิบายองค์ความรู้ด้านการประยุกต์คณิตศาสตร์เชิงคำนวณสำหรับการเรียนรู้ของเครื่องในปัจจุบันได้",
                "ประยุกต์องค์ความรู้ในการแก้ปัญหาได้อย่างเหมาะสม"

            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]

        },


        "09114702": {
                    "title_en": "Machine Learning 2",
                    "title_th": "การเรียนรู้ของเครื่อง 2",
                    "type": 4,
                    "group": 1,
                    "credits": 3,
                    "lecture_hr": 2,
                    "lab_hr": 2,
                    "prereq": "",
                    "description_en": "Concepts and principles of unsupervised machine learning, data clustering, k-means clustering, association data, support and confident factors, apriori algorithm, application model to data clustering.",
                    "description_th": "แนวคิดและหลักการของการเรียนรู้ของเครื่องแบบไม่มีผู้สอน การจัดกลุ่มข้อมูล การจัดกลุ่มแบบค่าเฉลี่ยเค การหากฎความสัมพันธ์ ปัจจัยสนับสนุนนและปัจจัยความเชื่อมั่น ขั้นตอนวิธีแบบนิรนัย การใช้ตัวแบบไปประยุกต์ใช้ในการจัดกลุ่มข้อมูล",
                    "clos": [
                        "อธิบายแนวคิดและหลักการของการเรียนรู้ของเครื่องแบบไม่มีผู้สอนได้",
                        "อธิบายการเลือกใช้อัลกอริทึมแบบไม่มีผู้สอนที่เหมาะสมสำหรับข้อมูลที่มีความหลากหลายได้",
                        "สร้างหรือพัฒนาแบบอัลกอริทึมแบบมีไม่มีผู้สอนในการจัดกลุ่มข้อมูลได้",
                        "วิเคราะห์ประสิทธิภาพของอัลกอริทึมแบบไม่มีผู้สอนได้",
                        "ใช้เครื่องมือการเรียนรู้ของเครื่องช่วยในการตัดสินใจในการแก้ปัญหาจริงได้"
                    ],
                    "los_mapping": [1, 2, 4, 5, 6, 10],
                    "plos_mapping": [1, 2, 4, 5, 6, 10]
            },


        "09114703": {
                    "title_en": "Reinforcement Machine Learning",
                    "title_th": "การเรียนรู้ของเครื่องแบบเสริมแรง",
                    "type": 4,
                    "group": 1,
                    "credits": 3,
                    "lecture_hr": 2,
                    "lab_hr": 2,
                    "prereq": "",
                    "description_en": "Markov decision processes, reward functions, value iteration, policy iteration, Q-learning, deep reinforcement learning, exploration-exploitation trade-off, function approximation, multi-agent reinforcement learning, simulation, performance evaluation",
                    "description_th": "กระบวนการตัดสินใจแบบมาร์คอฟ ฟังก์ชันรางวัล การวนซ้ำค่า การวนซ้ำนโยบาย การเรียนรู้คิว การเรียนรู้เชิงเสริมแรงแบบลึก การแลกเปลี่ยนระหว่างการสำรวจและการใช้ประโยชน์ การประมาณค่า การเรียนรู้แบบเสริมแรงในหลายตัวแทน การจำลอง การประเมินผลการดำเนินงาน",
                    "clos": [
                        "วิเคราะห์และอธิบายหลักการของกระบวนการตัดสินใจแบบมาร์คอฟและฟังก์ชันรางวัล",
                        "ประยุกต์ใช้วิธีการวนซ้ำค่าและวนซ้ำนโยบายในการค้นหานโยบายที่เหมาะสม",
                        "ประเมินและเปรียบเทียบเทคนิค Q-learning กับการเรียนรู้เชิงเสริมแรงแบบลึก",
                        "ออกแบบและพัฒนาระบบจำลองเพื่อทดสอบการแลกเปลี่ยนระหว่างการสำรวจและการใช้ประโยชน์",
                        "สร้างและวัดประสิทธิภาพของโมเดลการเรียนรู้แบบเสริมแรงในสภาพแวดล้อมจำลอง"
                    ],
                    "los_mapping": [1, 2, 4, 5, 6, 10],
                    "plos_mapping": [1, 2, 4, 5, 6, 10]
            },


        "09111705": {
            "title_en": "Deep Learning and Applications",
            "title_th": "การเรียนรู้เชิงลึกและการประยุกต์",
            "type": 1,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Fundamentals of neural networks, feed-forward and backpropagation learning, implementation with frameworks such as tensor flow or PyTorch, convolutional neural networks, recurrent neural networks, techniques to prevent overfitting, hyperparameter tuning, applications in real-world problems",
            "description_th": "พื้นฐานโครงข่ายประสาทเทียม การเรียนรู้แบบป้อนหน้าและการแพร่กลับ การใช้งานเฟรมเวิร์กเช่น TensorFlow หรือ PyTorch โครงข่ายประสาทแบบคอนโว ลูชัน โครงข่ายประสาทแบบหมุนเวียน เทคนิคป้องกันการฟิตเกิน การปรับจูนไฮเปอร์พารามิเตอร์ การประยุกต์ใช้ในการแก้ปัญหาจริง",
            "clos": [
                "เลือกใช้แบบจำลองให้เหมาะสมกับปัญหาที่หลากหลายได้อย่างเหมาะสม",
                "อธิบายการใช้เทคนิคโครงข่ายประสาทเทียมแบบประสานและโครงข่ายประสาทเทียมแบบวนซ้ำได้",
                "สร้างหรือพัฒนาอัลกอริทึมการเรียนรู้เชิงลึกเพื่อใช้แก้ปัญหาจริงได้"
            ],
            "los_mapping": [1, 2, 4, 5, 6, 10],
            "plos_mapping": [1, 2, 4, 5, 6, 10]
        },


        "09114704": {
            "title_en": "Machine Learning Engineering",
            "title_th": "วิศวกรรมการเรียนรู้ของเครื่อง",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Principles of Machine learning engineering, process and design of machine learning, machine learning development and deployment, data scraping for machine learning, machine learning web application development.",
            "description_th": "หลักการของวิศวกรรมการเรียนรู้ของเครื่อง กระบวนการและการออกแบบการเรียนรู้ของเครื่อง การพัฒนาและการปรับใช้การเรียนรู้ของเครื่อง การดึงข้อมูลสำหรับการเรียนรู้ของเครื่อง การพัฒนาเว็บแอพพลิเคชั่นเพื่องานการเรียนรู้ของเครื่อง ",
            "clos": [
                "อธิบายแนวคิดพื้นฐาน กระบวนการ และหลักการออกแบบระบบการเรียนรู้ของเครื่องได้",
                "ออกแบบและพัฒนาระบบการเรียนรู้ของเครื่องได้",
                "ดึงและจัดเตรียมข้อมูลสำหรับการเรียนรู้ของเครื่องได้",
                "ออกแบบ สร้างหรือพัฒนาเว็บแอพพลิเคชั่นเพื่องานการเรียนรู้ของเครื่องได้"
            ],
            "los_mapping": [1, 4, 5, 6, 10],
            "plos_mapping": [1, 4, 5, 6, 10]
        },

        "09114705": {
            "title_en": "Data Analytics",
            "title_th": "การวิเคราะห์ข้อมูล",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Data Analysis Methodology, Data Preparation, Data Cleaning, Data Transformation, Data Aggregation, Data Merging, Data Clustering, Data Reshaping, Data Table, Data Indexing, Data Filtering, Data Visualization, Statistical Analysis, Statistical Calculation, Time Series, Data Integration, Data Distribution, Group Summary, Data Quality Assessment, Dimensionality Reduction, Predictive Modeling, Outlier Detection, Forecasting Analysis, Data Processing, Data Reporting.",
            "description_th": "กระบวนการวิเคราะห์ข้อมูล การเตรียมข้อมูล การทำความสะอาดข้อมูล การแปลงข้อมูล การสรุปข้อมูล การรวมข้อมูล การจัดกลุ่มข้อมูล การปรับโครงสร้างข้อมูล ตารางข้อมูล ดัชนีข้อมูล การคัดกรองข้อมูล การสร้างแผนภาพข้อมูล การวิเคราะห์เชิงสถิติ การคำนวณสถิติ ข้อมูลเวลา การรวมแหล่งข้อมูล การวิเคราะห์การกระจาย การสรุปกลุ่มข้อมูล การตรวจสอบคุณภาพข้อมูล การลดมิติข้อมูล แบบจำลองทำนาย การตรวจจับค่าเบี่ยงเบน การวิเคราะห์เชิงคาดการณ์ การประมวลผลข้อมูล การสรุปผลเชิงข้อมูล",
            "clos": [
                "อธิบายกระบวนการวิเคราะห์ข้อมูลและขั้นตอนการเตรียมข้อมูลเพื่อระบุและประเมินความเหมาะสมของข้อมูล",  
                "จัดการการทำความสะอาดข้อมูล การแปลงข้อมูล และการรวมข้อมูลเพื่อสร้างฐานข้อมูลที่มีคุณภาพ",  
                "แสดงผลการสรุปข้อมูลและการจัดกลุ่มข้อมูลผ่านการสร้างแผนภาพและตารางข้อมูล",  
                "คำนวณค่าสถิติพื้นฐานและวิเคราะห์การกระจายของข้อมูลรวมถึงข้อมูลเวลาเพื่อสนับสนุนการตัดสินใจ",  
                "ประเมินแบบจำลองทำนายและการตรวจจับค่าเบี่ยงเบนเพื่อทำนายแนวโน้มและวิเคราะห์เชิงคาดการณ์ของข้อมูล"
            ],
            "los_mapping": [1, 2, 5, 6, 10],
            "plos_mapping": [1, 2, 5, 6, 10]

        },

        "09114706": {
            "title_en": "Data Visualization and Data Storytelling",
            "title_th": "การสร้างแผนภาพและการเล่าเรื่องด้วยข้อมูล",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Data Visualization Design, Bar Chart, Pie Chart, Line Chart, Scatter Plot, Interactive Graph, Infographic, Data Storytelling, Narrative Structure, Data Communication, Color Tone, Typography, Layout, Dashboard, Narrative Analysis, Stacked Bar Chart, Area Chart, Interactive Display, Symbol, Data Map, Scale, User Interface, Design Composition, Data Interpretation, Scaling.",
            "description_th": "การออกแบบภาพข้อมูล แผนภูมิแท่ง แผนภูมิวงกลม แผนภูมิเส้น แผนภูมิจุด กราฟอินเตอร์แอคทีฟ อินโฟกราฟิก การเล่าเรื่องด้วยข้อมูล โครงสร้างเรื่องเล่า การสื่อสารข้อมูล โทนสี แบบอักษร เลย์เอาท์ แดชบอร์ด การวิเคราะห์เรื่องเล่า กราฟแท่งซ้อน แผนภูมิรอยต่อ การแสดงผลอินเตอร์แอคทีฟ สัญลักษณ์ แผนที่ข้อมูล สเกล ส่วนติดต่อผู้ใช้ องค์ประกอบการออกแบบ การตีความข้อมูล การปรับขนาด",
            "clos": [
                "ออกแบบภาพข้อมูลที่สื่อความหมายได้ชัดเจนโดยใช้แผนภูมิแท่ง, แผนภูมิวงกลม, แผนภูมิเส้น และแผนภูมิจุด",
                "สร้างกราฟอินเตอร์แอคทีฟและอินโฟกราฟิกเพื่อสื่อสารข้อมูลอย่างมีประสิทธิภาพ",
                "วางโครงสร้างเรื่องเล่าเพื่อการเล่าเรื่องด้วยข้อมูลที่ชัดเจนและน่าสนใจ",
                "ประเมินองค์ประกอบการออกแบบ เช่น โทนสี, แบบอักษร, เลย์เอาท์ และแดชบอร์ดในการนำเสนอข้อมูล",
                "ตีความข้อมูลและปรับขนาดผ่านการวิเคราะห์แผนที่ข้อมูลเพื่อสนับสนุนการตัดสินใจ"
            ],
            "los_mapping": [1, 5, 6, 8, 10],
            "plos_mapping": [1, 5, 6, 8, 10]
        },

        "09114707": {
            "title_en": "Large Language Models",
            "title_th": "แบบจำลองภาษาขนาดใหญ่",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "scaling laws, transformer architectures, self-attention, pre-training, fine-tuning, transfer learning, contextual embeddings, few-shot learning, prompt engineering, retrieval augmented generation, evaluation metrics, ethical considerations, deployment strategies, performance optimization, model interpretability, dataset curation",
            "description_th": "กฎการขยายตัว สถาปัตยกรรมทรานส์ฟอร์มเมอร์ การสังเกตตัวตน การฝึกฝนล่วงหน้า การปรับจูน การถ่ายโอนความรู้ เวกเตอร์บริบท การเรียนรู้ด้วยตัวอย่างน้อย การออกแบบพรอมต์ การก่อกำเนิดที่เสริมด้วยการดึงข้อมูล  ตัวชี้วัดการประเมินผล ข้อควรพิจารณาทางจริยธรรม กลยุทธ์การนำไปใช้ การเพิ่มประสิทธิภาพ ความเข้าใจในแบบจำลอง การคัดเลือกชุดข้อมูล",
            "clos": [
                "วิเคราะห์และประเมินสถาปัตยกรรมทรานส์ฟอร์มเมอร์ และกลไกการสังเกตตัวตน ในการออกแบบแบบจำลองภาษาขนาดใหญ่",
                "ประยุกต์ใช้เทคนิคการเทรนล่วงหน้า การปรับจูน และการถ่ายโอนความรู้เพื่อพัฒนาแบบจำลองภาษาขนาดใหญ่",
                "สร้างและปรับแต่งพรอมต์ เพื่อเพิ่มประสิทธิภาพของแบบจำลองภาษาขนาดใหญ่ ในการเรียนรู้ด้วยตัวอย่างน้อย",
                "ประยุกต์ใช้เทคนิคการก่อกำเนิดที่เสริมด้วยการดึงข้อมูล เพื่อเสริมศักยภาพของระบบแบบจำลองภาษาขนาดใหญ่",
                "ประเมินและปรับปรุงตัวชี้วัดการประเมินผลและการเพิ่มประสิทธิภาพในการวัดความสามารถของแบบจำลองภาษาขนาดใหญ่",
                "อภิปรายข้อควรพิจารณาทางจริยธรรมและกลยุทธ์การนำไปใช้ในการประยุกต์แบบจำลองภาษาขนาดใหญ่"
            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]
        },


        "09114708": {
            "title_en": "Applications of Machine Learning in Image and Signal Processing",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านประมวลผลภาพและสัญญาณ",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "machine learning algorithms, image processing techniques, signal processing fundamentals, convolutional neural networks, feature extraction, dimensionality reduction, image segmentation, filtering methods, denoising, pattern recognition, time-frequency analysis, Fourier transform, wavelet transform, deep learning frameworks, application case studies",
            "description_th": "อัลกอริทึมการเรียนรู้ของเครื่อง, เทคนิคการประมวลผลภาพ, พื้นฐานการประมวลผลสัญญาณ, โครงข่ายประสาทเทียมแบบคอนโวลูชัน, การแยกคุณสมบัติ, การลดมิติ, การแบ่งส่วนภาพ, วิธีการกรอง, การลดเสียงรบกวน, การรู้จำรูปแบบ, การวิเคราะห์เวลา-ความถี่, การแปลงฟูเรียร์, การแปลงเวฟเลต, เฟรมเวิร์คการเรียนรู้เชิงลึก, กรณีศึกษาในการประยุกต์ใช้",
            "clos": [
                "วิเคราะห์และประเมินอัลกอริทึมการเรียนรู้ของเครื่องสำหรับงานประมวลผลภาพและสัญญาณ",
                "ประยุกต์ใช้เทคนิคการประมวลผลภาพและสัญญาณในการออกแบบระบบการเรียนรู้ของเครื่อง",
                "ออกแบบและพัฒนาระบบโครงข่ายประสาทเทียมสำหรับการแยกคุณสมบัติและแบ่งส่วนภาพ",
                "เปรียบเทียบและประเมินวิธีการกรองและลดเสียงรบกวนในสัญญาณ",
                "สร้างและทดสอบกรณีศึกษาในการประยุกต์ใช้การเรียนรู้ของเครื่อง ในงานประมวลผลภาพและสัญญาณ",
                "สังเคราะห์เทคนิคจากการประมวลผลภาพและสัญญาณเพื่อเพิ่มประสิทธิภาพของแบบจำลองการเรียนรู้ของเครื่อง"
            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]

        },

        "09114709": {
            "title_en": "Applications of Machine Learning in Healthcare",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในงานด้านสุขภาพ ",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Healthcare data analytics, medical imaging analysis, predictive modeling, electronic health records, bioinformatics, clinical decision support, risk stratification, survival analysis, personalized medicine, anomaly detection, treatment optimization, outcome prediction, patient monitoring",
            "description_th": "การวิเคราะห์ข้อมูลด้านสุขภาพ, การวิเคราะห์ภาพทางการแพทย์, การสร้างแบบจำลองเชิงพยากรณ์, บันทึกสุขภาพอิเล็กทรอนิกส์, ชีวสารสนเทศ, การสนับสนุนการตัดสินใจทางคลินิก, การแบ่งกลุ่มความเสี่ยง, การวิเคราะห์อัตราการรอดชีวิต, การแพทย์เฉพาะบุคคล, การตรวจจับความผิดปกติ, การเพิ่มประสิทธิภาพการรักษา, การทำนายผลการรักษา, การติดตามผู้ป่วย",
            "clos": [
                "วิเคราะห์และประเมินเทคนิคการวิเคราะห์ข้อมูลด้านสุขภาพเพื่อสนับสนุนการตัดสินใจทางคลินิก",
                "ประยุกต์ใช้แบบจำลองเชิงพยากรณ์ในงานวิเคราะห์ภาพทางการแพทย์และการทำนายผลการรักษา",
                "ออกแบบและพัฒนาระบบสนับสนุนการตัดสินใจทางคลินิกโดยใช้เทคนิคการเรียนรู้ของเครื่อง",
                "ประเมินและเปรียบเทียบประสิทธิภาพของโมเดลการคาดการณ์ผลการรักษาและการจัดการข้อมูลผู้ป่วย",
                "สังเคราะห์แนวคิดการแพทย์เฉพาะบุคคลและการแบ่งกลุ่มความเสี่ยงเพื่อเพิ่มประสิทธิภาพการรักษา",
                "สร้างและทดสอบระบบติดตามผู้ป่วยและการตรวจจับความผิดปกติในข้อมูลทางการแพทย์"
            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]
        },

        "09114710": {
            "title_en": "Applications of Machine Learning in Business and Finance",
            "title_th": "การประยุกต์ใช้การเรียนรู้ของเครื่องในด้านธุรกิจและการเงิน",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 2,
            "lab_hr": 2,
            "prereq": "",
            "description_en": "Business data analytics, predictive modeling, risk assessment, fraud detection, algorithmic trading, portfolio optimization, customer segmentation, sentiment analysis, supply chain optimization, decision support systems, revenue forecasting",
            "description_th": "การวิเคราะห์ข้อมูลทางธุรกิจ, การสร้างแบบจำลองเชิงพยากรณ์, การประเมินความเสี่ยง, การตรวจจับการฉ้อโกง, การซื้อขายอัตโนมัติ, การเพิ่มประสิทธิภาพพอร์ตโฟลิโอ, การแบ่งกลุ่มลูกค้า, การวิเคราะห์ความคิดเห็น, การเพิ่มประสิทธิภาพห่วงโซ่อุปทาน, ระบบสนับสนุนการตัดสินใจ, การทำนายรายได้",
            "clos": [
                "วิเคราะห์และประเมินเทคนิคการวิเคราะห์ข้อมูลเพื่อสนับสนุนการตัดสินใจในธุรกิจและการเงิน",
                "ประยุกต์ใช้แบบจำลองเชิงพยากรณ์ในการวิเคราะห์ความเสี่ยงและตรวจจับการฉ้อโกง",
                "ออกแบบและพัฒนาระบบการซื้อขายอัตโนมัติและการเพิ่มประสิทธิภาพพอร์ตโฟลิโอ",
                "สร้างและปรับแต่งแบบจำลองการแบ่งกลุ่มลูกค้าและการวิเคราะห์ความคิดเห็นเพื่อเพิ่มความแม่นยำ",
                "สังเคราะห์ข้อมูลจากห่วงโซ่อุปทานและการทำนายรายได้เพื่อปรับปรุงการวางแผนธุรกิจ"
            ],
            "los_mapping": [1, 2, 6, 7, 10],
            "plos_mapping": [1, 2, 6, 7, 10]
        },

        "09114711": {
            "title_en": "Special Topic in Machine Learning",
            "title_th": "หัวข้อพิเศษของการเรียนรู้ของเครื่อง ",
            "type": 4,
            "group": 1,
            "credits": 3,
            "lecture_hr": 3,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Theoretical advances for applications of machine learning, specific topics based on contemporary advances in science and technology, interests of individual instructor and students.",
            "description_th": "ความก้าวหน้าของการประยุกต์ใช้การเรียนรู้ของเครื่อง เรื่องเฉพาะแปรเปลี่ยนตามความสนใจของผู้สอนและนักศึกษา ซึ่งสอดคล้องกับ ความก้าวหน้าทางวิทยาศาสตร์และเทคโนโลยีในปัจจุบัน ",
            "clos": [
                "อธิบายองค์ความรู้ด้านการเรียนรู้ของเครื่องในปัจจุบันได้",
                "ประยุกต์องค์ความรู้ในการแก้ปัญหาได้อย่างเหมาะสม"
            ],
            "los_mapping": [1, 2, 6, 10],
            "plos_mapping": [1, 2, 6, 10]

        },

        "09115701": {
            "title_en": "Independent Study",
            "title_th": "สารนิพนธ์",
            "type": 5,
            "group": 1,
            "credits": 6,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Students are expected to complete at least 10 credits of study with approval from advisors. This must be related with the subject or knowledge, which students have learned from the courses.",
            "description_th": "นักศึกษาที่จะทำสารนิพนธ์จะต้องผ่านวิชาบังคับในหลักสูตรอย่างน้อย 10 หน่วยกิต หรือตามที่ภาควิชาฯ เห็นชอบ หัวข้อสารนิพนธ์จะต้องได้รับการเห็นชอบจากอาจารย์ที่ปรึกษาและภาควิชาฯ และต้องเป็นหัวข้อที่เกี่ยวข้องกับเนื้อหาวิชาที่ได้เรียนมาในหลักสูตร ",
            "clos": [
                "ศึกษา ค้นคว้าและอธิบายองค์ความรู้จากงานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้",
                "ออกแบบกระบวนการทำวิจัยและดำเนินการทำวิจัยได้อย่างถูกต้องตามหลักจริยธรรมของการวิจัยและจรรยาบรรณของนักวิจัย",
                "ประมวลองค์ความรู้งานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้ รวมถึงประยุกต์ใช้เทคโนโลยีและองค์ความรู้ที่จากงานวิจัยเพื่อการแก้ปัญหาหรือพัฒนานวัตกรรมได้",
                "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "plos_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
        },

        "09115702": {
            "title_en": "Thesis",
            "title_th": "วิทยานิพนธ์",
            "type": 6,
            "group": 1,
            "credits": 12,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Students are required to conduct a thesis under supervision of advisors appointed by graduate college. Rules and regulations for under taking thesis set by students’ department and graduate college must be observed strictly.",
            "description_th": "นักศึกษาต้องทำวิทยานิพนธ์ภายใต้คำแนะนำของอาจารยที่ปรึกษาที่ได้รับการแต่ง ตั้งโดยบัณฑิตวิทยาลัย นักศึกษาต้องปฏิบัติตามกูฏและข้อบังคับที่กำหนดโดยภาควิชาและบัณฑิตวิทยาลัยอย่างเคร่งครัด",
            "clos": [
                "ศึกษา ค้นคว้าและอธิบายองค์ความรู้จากงานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้",
                "ออกแบบกระบวนการทำวิจัยและดำเนินการทำวิจัยได้อย่างถูกต้องตามหลักจริยธรรมของการวิจัยและจรรยาบรรณของนักวิจัย",
                "สร้างหรือพัฒนาองค์ความรู้งานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้ รวมถึงประยุกต์ใช้เทคโนโลยีและองค์ความรู้ที่จากงานวิจัยเพื่อการแก้ปัญหาหรือพัฒนานวัตกรรมได้",
                "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "plos_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
        },

        "09115703": {
            "title_en": "Thesis",
            "title_th": "วิทยานิพนธ์",
            "type": 6,
            "group": 1,
            "credits": 36,
            "lecture_hr": 0,
            "lab_hr": 0,
            "prereq": "",
            "description_en": "Students are required to conduct a thesis under supervision of advisors appointed by graduate college. Rules and regulations for under taking thesis set by students’ department and graduate college must be observed strictly.",
            "description_th": "นักศึกษาต้องทำวิทยานิพนธ์ภายใต้คำแนะนำของอาจารยที่ปรึกษาที่ได้รับการแต่ง ตั้งโดยบัณฑิตวิทยาลัย นักศึกษาต้องปฏิบัติตามกูฏและข้อบังคับที่กำหนดโดยภาควิชาและบัณฑิตวิทยาลัยอย่างเคร่งครัด",
            "clos": [
                "ศึกษา ค้นคว้าและอธิบายองค์ความรู้จากงานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้",
                "ออกแบบกระบวนการทำวิจัยและดำเนินการทำวิจัยได้อย่างถูกต้องตามหลักจริยธรรมของการวิจัยและจรรยาบรรณของนักวิจัย",
                "สร้างหรือพัฒนาองค์ความรู้งานวิจัยด้านการประยุกต์คณิตศาสตร์เชิงคำนวณและการเรียนรู้ของเครื่องได้ รวมถึงประยุกต์ใช้เทคโนโลยีและองค์ความรู้ที่จากงานวิจัยเพื่อการแก้ปัญหาหรือพัฒนานวัตกรรมได้",
                "เขียนรายงานวิจัยและนำเสนอผลงานวิจัยเป็นภาษาอังกฤษได้"
            ],
            "los_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
            "plos_mapping": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
        }

    }
}